jekyll/mountaineering/memorable_cafes_and_pubs.html
--- 
layout: mountaineering
title: Memorable Cafes and Pubs.
--- 


<p>
This page isn't specifically about mountaineering, but since cafes and
pubs are important to my enjoyment of climbing I thought I would add a
few short reviews here. Note that not all the cafes and pubs reviewed
are anywhere near to a mountain or rock face. However, it's useful to
know where there is a decent establishment whatever part of the
country you are in. The information provided is purely my own personal
opinion and since places change over the years, your experiences might
be different to mine!
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">North Wales.</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Llanberis.</h3>
<div class="outline-text-3" id="text-1.1">

<p>Many years ago (1970's) there was Wendy's, which was owned by two
climbers. Wendy's deserved the full three Skull and Crossbones award
in the Greasy Spoon Cafe Awards. In 1978, after Wendy's had closed,
Pete and Vicky Norton opened <a href="http://www.petes-eats.co.uk/">Pete's Eats</a> . The cafe is still in the
same place and still run by Pete and Vicky, though they take a more
back seat role these days. It has now expanded both into the house
next door and into a restaurant on the opposite side of the road. The
food is good with a varied menu. You can while away wet days drinking
mugs of tea looking at the digital slide-show and reading the
newspapers and magazines. There is the legendary "Big Jim". If you can
finish one of these without your arteries getting completely clogged,
you get another one free!  Accomodation and Internet access is also
available.
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Nant-Peris</h3>
<div class="outline-text-3" id="text-1.2">

<p>The <a href="#[[http://www.vaynolarms.co.uk">Vaynol Arms</a>. Decent beer and good food. In the old days you needed
to be careful not to upset Don Whillans, who was frequently propping
up the bar.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">Tremadoc.</h3>
<div class="outline-text-3" id="text-1.3">

<p><a href="http://www.ericjones-tremadog.co.uk/">Eric Jones cafe</a> is conveniently situated right under the crag. You can
gaze at pictures of Eric's exploits while eating your food. There is
also a campsite and a bunk house. At one time Eric used to wake
campers with a fresh mug of tea, although I suspect that this was a
ploy to stop people getting away without paying.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Peak District.</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">Outside</h3>
<div class="outline-text-3" id="text-2.1">

<p>Hathersage and Calver Crossroads.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">Stoney Cafe.</h3>
<div class="outline-text-3" id="text-2.2">

<p>In the 70's and 80's this was a very popular meeting place for climbers. It was closed for a while, but has now re-invented itself as a Cafe/Bistro.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">The Chequers Frogatt.</h3>
<div class="outline-text-3" id="text-2.3">

<p>Traditional pub below the Edge.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Alps.</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">Chamonix.</h3>
<div class="outline-text-3" id="text-3.1">

<p>At one time the Bar Nationale was a mecca for British
alpinists. Slightly less expensive than other bars, it had a slightly
run down ambiance. Maurice, the proprietor, would peer at you with an
amazing cross eyed expression. Despite having no interest in climbing
Maurice was synpathetic to the unruly Brits who spent all day in has
bar drinking a single beer. Sadly he died a couple of years ago having
spent the latter part of is life confined upstairs in the Bar.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Shropshire</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">Ludlow.</h3>
<div class="outline-text-3" id="text-4.1">

<p><a href="http://www.degreys.co.uk/tea-rooms.htm">De Grey's</a> tea rooms. Step into your Tardis and go back to the golden
age of English tea room. Tea is brought to your table by one of the
many waitresses, smartly dressed in starched white aprons. Cakes and
pastries are baked in their own bakery and a selection is placed on
your table on one of those three tier contraptions you see in old
films.
</p></div>
</div>
</div>
